一.简单自我介绍
1).你的教育背景(学历/学位)
2).工作经历(你在哪几家公司待过 / 你在这家公司的岗位)
3).项目经历(xxxx项目(从什么时间开始到什么时候介绍))
4).在这过程中学到了什么技术?(oracle sql plsql/shell hive hadoop ,azkaban, kettle, 帆软BI)
5).以上我的简单介绍


二.正式面试环节:
1. 在最近的一个项目中担任什么角色?
ETL开发 / 数据开发 /大数据开发 / 数据仓库开发
2.你最近一个项目加班多不多?
3.是否接受加班?接受!
4.我们这个工作地点在xx地方,你愿意不愿意到这边来?
5.说说你最近一个项目的情况:
6.说说你对数据仓库的理解?
  数据仓库是什么?
  跟普通数据库比较有什么区别?
  数据仓库与数据集市的区别? 数据集市是部门级的数据仓库
7.数据仓库怎么分层?
  从数据抽取到仓库,如何分层,每层怎么开发,具体的做什么?
  你负责哪层的工作？
  你们这个项目总共抽取了多少张表？涉及哪些系统？表的数据量多少？
  --涉及哪些系统？
  1.ECIF系统（客户信息）
  2.核心系统（交易）
  3.信贷系统（对公信贷、对私(个贷)信贷）
  4.风险系统
  5.评级系统
  6.中间业务系统（理财业务、代销业务[代销基金、代销保险、代销理财产品]）
  补充：
  --这个项目总共抽取了多少张表？
  300-800
  
  表的数据量多少？
  xxx信息表、字典表、码表，信贷系统的，数据量一般在几千到十几万
  交易类、事件类、流水表、日志表，数据量从几百万到上千万。
  
  数据是怎么抽取到ods,用了什么工具？
  数据抽取有两种方式：1.ftp下载对应系统的离线文件，到本地，然后再加载到ods;
                        比如（核心系统、ecif系统）,离线文件的字符分隔符是什么？是定长文件(数据接口文件说明文档可以了解每个字段值的长度)，数据仓库hive表，字段分割符'\001'
				      2.用抽取工具，sqoop直连业务系统的备库抽取到hdfs,然后通过 alter table add partition location 参数映射到对应路径
  
  ods表的抽取频率和策略？
  1.抽取频率： 每天定时抽取前一天的（T-1），一般是凌晨1-2点开始
  2.抽取策略(全量/增量)：1.事件类、交易表、流水表、日志表用增量抽取，抽取条件就是表里面的xx日期（比如交易日期）
                         2.xxx信息表，用全量抽
  
  在清洗过程中,如何处理空值问题?
  1.如何空值是有业务意义,保留空值,不处理
  2.如何空值没有业务意义,用默认值替换(数字型字段一般填 0 ,其他比如字符型可以填默认值(N))
  
8. 用过哪些数据同步工具? sqoop / datax / kettle
9. 你最近的一个项目里面,用什么调度工具? azkaban , airflow,海豚调度DolphinScheduler
   上线一个调度任务需要注意哪些问题? 
   
   
   --最需要注意的是任务之间的依赖关系(上游依赖和下游依赖) / 任务启动时间 / 任务优先级 / 重跑次数和间隔(10-15分钟) / 告警(通知,配置OA邮箱/微信号/手机号)
   
   
   
   
10. 你最近一个项目用的是什么平台/数据库? hadoop+hive 







    说说你对hadoop的理解? 
	--hadoop是一个分布式系统基础框架,主要解决海量数据的存储和计算问题.
	  hadoop主要包括三大核心组件:
	  1. hdfs: 分布式文件系统
	  2. MapReduce:分布式计算框架
	  3. yarn:一个资源调度平台，负责为运算程序提供服务器运算资源(内存/CPU/IO)
	
	能不能说说hdfs的读/写流程:   --回答的时候要说出namenode和datanode
	hdfs写流程:
	
	能不能说你对mapreduce的理解:  --https://blog.csdn.net/qq_43061290/article/details/124841929
	MapReduce是一个分布式计算框架,主要分两个阶段:
	1.Map阶段 .....对数据进行切片 /并行读取
	     --shuffle阶段   对数据进行处理
	2.Reduce阶段....对map阶段输出进行汇总/输出 
	
11. 对hive熟不熟?
    说说你对hive的认识和理解?(hive是什么?)
	--Hive 是基于 Hadoop 的一个数据仓库工具，可以将结构化的数据文件映射为一张表，并提供类 SQL 查询功能.
	  hive可以将hive sql转化成MapReduce任务并提交到hadoop集群执行,并接受返回结果
   
    用过哪些hive执行引擎: 1.MapReduce /  2.Spark / 3.Tez
	
12. ods层你是什么设计的?(其实是hive表类型 / 分区表 / 数据抽取的问题)
    用hive分区表,一般是按天分区.
	
	hive分区表如何实现? 
	--create table(col datatype,....) partitioned by(bus_date string)
	
	hive分区表如何实现动态分区? 
	--先创建hive分区表,然后在insert/load数据前打开动态分区功能
	--开启动态分区功能
	set hive.exec.dynamic.partition=true;
    --设置为非严格模式	
    set hive.exec.dynamic.partition.mode=nonstrict;
	
13. 有没有用过hive外部表?如何创建hive外部表?
    create external table tabname();
	
	如何确定一个hive表是内部表还是外部表? desc formatted 表名
	如何查看一个hive表的大小?  desc formatted 表名
	
	hive内部表和外部表的区别?
	删除外部表只是删除元数据(表结构),数据不删除;
	删除内部表会把元数据和数据一起删除;
	
14.对分桶了解多少?什么情况会进行分桶?分区与分桶的区别？
   分桶是在分区的基础上,对数据文件再做拆分,主要采用hash算法.
   一般在分区之后,数据量还很大的时候,考虑进行分桶.
   
   分桶的桶数怎么设计?(选什么字段作为分桶键?,一般会分多少个桶)?
     --一般桶的数量为2的整数次幂,采用hash算法,hash数据结构的容量正好是2的整数次幂
	 --分桶字段选择主键字段(数值型)
   
15.分桶与分区的区别?
   分区针对的是数据的存储路径(目录)；分桶针对的是数据文件。
   
   
   
   
   
   
   
   
   
   
   
16.日常写hive SQL 多不多? --多
   有没有遇到hive SQL跑得很慢的情况?--有
   遇到这种情况,你会怎么去找原因?
   1.先分析源表(from语句 / join语句那里的表数据量是不是最近突然增大,原因是否正常)
     --如果是异常原因导致:比如数据重复加载/或者是join字段因为错位导致出现Null值,这个时候需要去重;如何依赖的表不属于你负责,可以将问题反馈给负责人
	 --如果是正常原因导致:这个时候需要考虑 hive sql优化 
	 
   2.你熟悉hive SQL优化吗?--01课件\优化专题\HIVE调优策略.pdf
   
   3.你有没有遇到过数据倾斜问题?--有
   
   
   
     --数据清晰的原因:
	 --怎么知道是数据倾斜?数据清晰的现象? 
	    任务进度长时间维持在99%（或100%），查看任务监控页面，发现只有少量（1个或几个）
    
	 --如何解决数据倾斜?
	 1. 参数调节：
	    hive.map.aggr=true; --开启Map 端部分聚合
		hive.groupby.skewindata=true; --打开负载均衡参数
		set hive.exec.parallel.thread.number=16;--增加reducer数量
     2. 在MR里对数据进行分区，在Reducer 内部进行排序
	    distribute by +  
	    如何 distribute by的字段 与 sort by 字段相同，可以使用 cluster by来代替
		
	 3.使用map_side_join（mapjoin）
	 
	 4. 调整SQL
	    (1).加盐(在字段值左边加随机数) ,
		(2).空值(null),可以先过滤，或者把空值打散(替换成随机数)，null,
		(2).把key=K10001的数据打散，分成多份（比如20分）
		    WHEN a.Key = 'K10001' THEN Hash(Rand()) % 20 ELSE a.Key End
			
   举个数据倾斜的案例：
   select count(distinct userid) --活跃客户
     from xxx表
    group by 某年;
	
	--优化：用group by来代替 distinct
	
	 
17.你有没有用过版本管理工具?
   常用的代码/文档版本管理工具: svn / git / githup
  
18.日常工作中,开发需求是谁给你的?


   项目经理
   
   
   
19.开发需求通过什么方式给到你?
   RTX: 腾讯通（内部日常沟通工具）
   内部OA邮箱


   1.文档方式 / 内部聊天沟通工具/ 内部OA邮箱 /腾讯RTX
   
   2.jira (JIRA是Atlassian公司出品的项目与事务跟踪工具，被广泛应用于缺陷跟踪、客户服务、需求收集、流程审批、任务跟踪、项目跟踪和敏捷管理等工作领域。)
  
  

20.拿到一个需求,你是如何处理的?(从接到需求到上线)
   1.先看需求文档描述是否详细/完整
     比如:1.有没有给出数据来源(系统表/数据仓库表)   
	      2.有没有给指标计算口径/处理逻辑
		  3.权限问题(主要数据库表读权限/目标表写入权限)等
          在数据仓库项目中,数据来源和指标口径一般会有mapping文档
		  
   2.根据业务逻辑编写代码实现(编写代码过程中应注意什么问题?)
     要注意开发规范: 1.要有合适的中文注释
	                 2.表名/字段名要规范,尽可能体现业务含义
					 3.代码格式要统一大小写,要有适当的层次和缩进
					 4.要考虑性能问题(不要select *,注意join的时候要指定关联条件,指定where子句里面的分区字段)
   3.写完之后先要自己测试(抽样测试，抽取几个客户/账户的明细，单独汇总出来跟批量跑出来的结果核对)
   4.自己测完给测试人员测(如果有)，如果没有专门的测试人员，找需求方验证。
   5.测试通过之后,提上线申请[在系统上提](需要附上上线文档.rar(测试报告/源码/上线步骤(包括表数据备份、源代码备份步骤、上线操作步骤和回退操作步骤))
   6.管理人员会组织评审代码,评审通过之后才可以上线
   7.选择业务空闲时间部署代码并测试.
 
21. 什么是维表?什么是事实表?
    面试宝典里面找


22. 你最近一个项目用的是什么模型?雪花模型还是星型模型?
    星型模型和雪花模型的区别和联系?
	--0918\07.数据仓库理论



















	
23.拉链表的原理和应用场景(缓慢变化维SCD)
   拉链表还有没有其他应用场景？
   有：定期存款表
   
   拉链表与快照表相比，有什么优缺点？
   1.优点: (1).拉链表对存储空间的要求比快照表小，数据冗余小，因为拉链表只更新变化的数据，快照表是每天一份备份，存储空间要求多。
           (2).拉链表在查询某些数据，比如客户的余额变更历史的时候，比快照表查询要快；
   2.缺点：
           (1).拉链表的实现难度(代码实现的角度)比快照表大，因为拉链表的数据更新涉及到闭链和开链；
           (2).拉链表在实现查询某一个历史时间点的版本数据的时候，性能比快照表慢；




24. 你最近一个数据仓库项目,用到了哪些业务系统?
    1.信贷系统
	2.核心系统(客户交易)  CB
	3.ECIF系统(客户信息)  CI
	4.评级系统
	5.风险系统

25. 在数据仓库项目实施过程中,mapping文档什么时候生成?具体内容(格式)是什么?
    mapping文件应该在数据接入到ODS之前生成包括:
	1.源系统与ods层表级/字段级别的映射关系mapping文档
	2.ods层与dwd层表级/字段级别的映射关系mapping文档、dim层表级/字段级映射关系mapping文档
    3.dwd层与dws层表级/字段级别的映射关系mapping文档
	
	
26.对linux系统熟不熟悉?平时都用过哪些linux命令
   ls
   cp
   mv
   cd
   pwd
   rm
   mkdir
   rmdir
   chmod
   useradd
   执行shell脚本的命令:
   sh 可以没有没有执行权限
   ./ 需要执行权限  
   --重点
   grep 
   awk
   sed
   cut
   tail -f
   more
   head
   wc 
   find . -name ""
   --进程相关
   kill -9 
   ps -ef
   ps -aux
   
示例一:查看当前目录下文件名包含ABC的文件,并统计文件里面有多少行数据

find . -name "*ABC*" | cat | wc -l 
 

	
示例二:查看当前目录下文件名包含runlog.txt 的文件,并统计文件里面包含'error'字符的数据有多少行
find . -name "runlog.txt" | grep "error" | wc -l	
	
27.在开发过程中,你会用到哪些文档?
   1.系统的数据字典文档(包含表说明/字段说明/字段类型)	
   
   2.如何无法提供数据字典文档,应该从哪里找数据字典说明?
     从数据资产管理平台获取
	
28.如果你想熟悉某块业务功能,除了阅读相关文档以外,还可以通过哪些途径熟悉?
   1.系统操作手册、系统功能说明书等文档
   2.从知识共享平台获取(confluence/wiki)
	
	
29.oracle sql优化有哪些方法?
	
30.oracle主键索引与唯一索引的区别
   	主键索引不允许有空值,唯一索引允许字段有空值;
	
	
31. oracle 存储过程与函数的区别
    1.函数必须有返回值,存储过程没有返回值;
	2.自定义函数可以在select 语句里面使用，存储过程不能

	
	
	
   
  